Revit 2024 API
InternalDefinition Class
 This object represents a parameter definition in an Autodesk Revit model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class InternalDefinition : Definition,
	IDisposable
Visual Basic
Public Class InternalDefinition _
	Inherits Definition _
	Implements IDisposable
Visual C++
public ref class InternalDefinition : public Definition,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definition
 Autodesk.Revit.DB.InternalDefinition
See Also
InternalDefinition Members
Autodesk.Revit.DB Namespace